//普通
let normal = [
    {
        question: '《暗黑破坏神Ⅲ》是由下列哪个公司开发的?',
        options: ['暴雪娱乐', '网易', '腾讯', '索尼']
    },
    {
        question: '《暗黑破坏神Ⅲ》国服是由下列哪个公司代理的?',
        options: ['网易', '盛大', '腾讯', '凯恩之角']
    },
    {
        question: '《暗黑破坏神Ⅲ》全球发售时间是?',
        options: ['2012年5月15日', '2015年5月27日', '2015年3月24日', '2014年3月15日']
    },
    {
        question: '《夺魂之镰》中的新职业是?',
        options: ['圣教军', '猎魔人', '武僧', '德鲁伊']
    },
    {
        question: '"圣光啊,你有看到那个敌人吗?"是谁的台词?',
        options: ['圣堂骑士寇马可', '盗贼林登', '魔女爱莲娜', '牧师安度因']
    },
    {
        question: '下列套装中,只有在在折磨以上难度才能掉落的是?',
        options: ['圣光追寻者', '唤魔师的荆棘', '神龙之魂', '神圣护卫']
    },
    {
        question: '下列套装中,只有在在折磨以上难度才能掉落的是?',
        options: ['暗影装束', '马纳祖玛之道', '恶魔之皮', '黑棘的战铠']
    },
    {
        question: '对圣教军玩家来说,下列腰带中掉率最低的是?',
        options: ['行巫时刻', '宝藏腰带', '雷神之力', '万象皆杀']
    },
    {
        question: '下列装备中最萌的是?',
        options: ['亨利的永恒追捕', '塔·拉夏的坚定目光', '艾伯力·卡罗' ,'骄矜必败']
    },
    {
        question: '下列技能中不能免疫控制的是?',
        options: ['战吼', '烟雾弹', '御法者', '灵光悟']
    },
    {
        question: '谎言之王是哪个Boss?',
        options: ['比列', '阿兹莫丹', '迪亚波罗', '沈老贪']
    },
    {
        question: '下列哪件装备只能从赫拉迪姆宝匣中获取?',
        options: ['皇家华戒', '地狱火戒指', '乔丹之石', '李奥瑞克的玺戒']
    },
    {
        question: '"再来一次,女儿"是谁的台词?',
        options: ['爱德莉亚', '凯恩', '海德格', '林登']
    },
    {
        question: '在专家模式中阵亡后,下列数据不能保留的是?',
        options: ['包裹', '巅峰等级', '仓库', '血岩碎片']
    },
    {
        question: '暗黑3游戏中,下列关卡不存在的是?',
        options: ['凯恩之角', '奶牛关', '欢乐谷', '宝藏秘境']
    }
];

//困难
let hard = [
    {
        question: '"我见过更好的"是谁的台词?',
        options: ['卡达拉', '皮诺·马雷拉', '', '']
    },
    {
        question: '《暗黑破坏神Ⅲ：夺魂之镰》国服正式运营时间是?',
        options: ['2015年5月27日', '2012年5月15日', '2015年3月24日', '2014年3月15日']
    },
    {
        question: '"啊，海德格，救我~"是谁的台词?',
        options: ['海德格的老婆','海德格的徒弟','莉亚','奈非天']
    },
    {
        question: '下列哪件装备只能从赫拉迪姆宝匣中获取?',
        options: ['贪婪腰带', '迅击腰带', '藏红裹腰', '宝藏腰带']
    },
    {
        question: '"虽然我个子小，但是如果你想偷我的东西，我一定会让你好看。"是谁的台词?',
        options: ['小贩阿扭','','','']
    },
    {
        question: '进入欢乐谷可以获得哪项伟业?',
        options: ['夺命独角兽之地', '获选之人', '品位出众', '大熊宝殿']
    }
];

//大师
let master = [
    {
        question: '"我也当过冒险者,但那不合我的胃口,痛苦太多,收获太少。"是谁的台词?',
        options: ['','','','']
    },
    {
        question: '"兄弟们，至死方休！"是谁的台词?',
        options: ['海利队长','','','']
    },
    {
        question: '"佩什科夫之眼"的特效是?',
        options: [
            '使回天息的冷却时间缩短。',
            '对敌人造成伤害时有一定几率使你的技能不消耗内力。',
            '使用眩目闪恢复一定内力。',
            '金轮阵使每秒恢复的内力提高 。'
        ]
    },
    {
        question: '在开发者地狱中可以获得哪个伟业?',
        options: ['海扁阿杰', '夺命独角兽之地', '灵魂收集者', '暗黑霸主']
    },
    {
        question: '2.0.6版本时,全球首位达到巅峰800级的玩家是?',
        options: ['漫延', 'Alkaizer', 'Gabynator', '난강하다']
    }
];

//折磨
let torment = [
    {
        question: '"你这个自以为是的涅法雷姆"是谁的台词?',
        options: ['阿兹莫丹', '迪亚波罗', '李奥瑞克', '比列']
    },
    {
        question: '暗黑3的首任游戏总监是?',
        options: ['Jay Wilson', 'Josh Mosquiera', 'Brian Kindregan', 'Blood Face']
    },
    {
        question: '下列伟业不能通过购买典藏版获得的是?',
        options: ['暗黑霸主', '灵魂收集者', '大熊宝殿', '天谴女皇']
    },
    {
        question: '1.0.4版本时,全球首位达到巅峰100级的玩家是?',
        options: ['Alkaizer', '漫延', 'Gabynator', '春日の山']
    }
];

let data = [normal, hard, master, torment];

export default data;