//普通
let normal = [
    {
        question: '《暗黑破坏神Ⅲ》是由下列哪个公司开发的?',
        options: ['暴雪娱乐', '网易', '腾讯', '索尼']
    },
    {
        question: '《暗黑破坏神Ⅲ》国服是由下列哪个公司代理的?',
        options: ['网易', '盛大', '腾讯', '凯恩之角']
    },
    {
        question: '《暗黑破坏神Ⅲ》全球发售时间是?',
        options: ['2012年5月15日', '2015年5月27日', '2015年3月24日', '2014年3月15日']
    },
    {
        question: '《夺魂之镰》中的新职业是?',
        options: ['圣教军', '猎魔人', '武僧', '德鲁伊']
    },
    {
        question: '"圣光啊,你有看到那个敌人吗?"是谁的台词?',
        options: ['圣堂骑士寇马可', '盗贼林登', '魔女爱莲娜', '牧师安度因']
    },
    {
        question: '下列装备中最萌的是?',
        options: ['亨利的永恒追捕', '塔·拉夏的坚定目光', '艾伯力·卡罗' ,'骄矜必败']
    },
    {
        question: '下列技能中不能免疫控制的是?',
        options: ['战吼', '烟雾弹', '御法者', '灵光悟']
    },
    {
        question: '谎言之王是哪个Boss?',
        options: ['比列', '阿兹莫丹', '迪亚波罗', '沈老贪']
    },
    {
        question: '下列哪件装备只能从赫拉迪姆宝匣中获取?',
        options: ['皇家华戒', '地狱火戒指', '乔丹之石', '李奥瑞克的玺戒']
    },
    {
        question: '"再来一次,女儿"是谁的台词?',
        options: ['爱德莉亚', '凯恩', '海德格', '林登']
    },
    {
        question: '在专家模式中阵亡后,下列数据不能保留的是?',
        options: ['包裹', '巅峰等级', '仓库', '血岩碎片']
    },
    {
        question: '暗黑3游戏中,下列关卡不存在的是?',
        options: ['凯恩之角', '奶牛关', '欢乐谷', '宝藏秘境']
    },
    {
        question: '赛季之旅是哪一个赛季中新增的游戏内容?',
        options: ['第四赛季', '第一赛季', '第二赛季', '第三赛季']
    },
    {
        question: '传奇宝石的第二特性在多少级时解锁?',
        options: ['25级', '10级', '30级', '50级']
    },
    {
        question: '一个人物身上最多可以有多少个镶孔?',
        options: ['11', '10', '12', '9']
    },
    {
        question: '单手弩枪的基础攻速是?',
        options: ['1.6', '1.4', '1.7', '1.8']
    },
    {
        question: '被称作"泰巴马"的NPC是?',
        options: ['泰瑞尔', '泰勒·斯威夫特', '奥巴马', '迪卡凯恩']
    },
    {
        question:  '夺魂之镰是谁的武器?',
        options: ['马萨伊尔', '恐惧之王' , '泰瑞尔', '英普瑞斯']
    }
];

//困难
let hard = [
    {
        question: '"我见过更好的"是谁的台词?',
        options: ['卡达拉', '沈老贪', '泰瑞尔', '迪卡凯恩']
    },
    {
        question: '《暗黑破坏神Ⅲ：夺魂之镰》国服正式运营时间是?',
        options: ['2015年5月27日', '2012年5月15日', '2015年3月24日', '2014年3月15日']
    },
    {
        question: '"啊，海德格，救我~"是谁的台词?',
        options: ['海德格的老婆','海德格的徒弟','莉亚','奈非天']
    },
    {
        question: '下列哪件装备只能从赫拉迪姆宝匣中获取?',
        options: ['贪婪腰带', '迅击腰带', '藏红裹腰', '宝藏腰带']
    },
    {
        question: '"我虽然个子很小，但如果你想偷我的东西，我一定抽死你。"是谁的台词?',
        options: ['小贩阿扭','卡达拉','沈老贪','欧雷克']
    },
    {
        question: '进入欢乐谷可以获得哪项伟业?',
        options: ['夺命独角兽之地', '获选之人', '品位出众', '大熊宝殿']
    },
    {
        question: '精英怪的伤害反射是什么类型的伤害?',
        options: ['与造成伤害的类型相同', '物理伤害', '无元素伤害', '火焰伤害']
    },
    {
        question: '单手重武器的基础攻速是?',
        options: ['1.3', '1.2', '1.4', '1.5']
    },
    {
        question: '下列套装中,只有在在折磨以上难度才能掉落的是?',
        options: ['圣光追寻者', '唤魔师的荆棘', '神龙之魂', '神圣护卫']
    },
    {
        question: '下列套装中,只有在在折磨以上难度才能掉落的是?',
        options: ['暗影装束', '马纳祖玛之道', '恶魔之皮', '黑棘的战铠']
    },
];

//大师
let master = [
    {
        question: '"我也当过冒险者,但那不合我的胃口,痛苦太多,收获太少。"是谁的台词?',
        options: ['收藏家维达尔','矿工博图尔夫','军需官格雷尔','铁匠海德格']
    },
    {
        question: '"兄弟们，至死方休！"是谁的台词?',
        options: ['海利队长','泰瑞尔','英普瑞斯','洛拉斯']
    },
    {
        question: '『佩什科夫之眼』的特效是?',
        options: [
            '使回天息的冷却时间缩短',
            '造成伤害时有几率不消耗内力',
            '使用眩目闪恢复一定内力',
            '金轮阵使每秒恢复的内力提高'
        ]
    },
    {
        question: '在开发者地狱中可以获得哪个伟业?',
        options: ['海扁阿杰', '夺命独角兽之地', '灵魂收集者', '暗黑霸主']
    },
    {
        question: '2.0.6版本时,全球首位达到巅峰800级的玩家是?',
        options: ['漫延', 'Alkaizer', 'Gabynator', '난강하다']
    },
    {
        question: '下列传奇剑中哪一件是由玩家设计的?',
        options: ['憎恨裂片', '霜心', '雷霆之怒，逐風者的祝福之刃', '碧藍怒火']
    },
    {
        question: '玩家进入游戏后见到的第一个NPC是?',
        options: ['兰佛德队长', '迪卡凯恩', '莉亚', '海德格']
    },
    {
        question: '『斯塔加德的屠戮者』的特效是什么类型的元素伤害?',
        options: ['物理', '火焰', '神圣', '与人物元素加成类型相同']
    },
    {
        question: '曾经被称作"CB锤"的武器是?',
        options: ['焚炉', '日光守祭', '奥丁之子', '回荡狂怒']
    },
    {
        question: '对圣教军玩家来说,下列腰带中掉率最低的是?',
        options: ['行巫时刻', '宝藏腰带', '雷神之力', '万象皆杀']
    },
    {
        question: '外形酷似"米老鼠"的传奇项链是?',
        options: ['赫尔希恩之飞升', '先祖恩眷', '阿卡兰斯之星', '艾利曲之眼']
    }
];

//折磨
let torment = [
    {
        question: '"你这个自以为是的涅法雷姆"是谁的台词?',
        options: ['阿兹莫丹', '迪亚波罗', '李奥瑞克', '比列']
    },
    {
        question: '暗黑3的首任游戏总监是?',
        options: ['Jay Wilson', 'Josh Mosquiera', 'Wyatt Cheng', 'Blood Face']
    },
    {
        question: '下列伟业不能通过购买典藏版获得的是?',
        options: ['暗黑霸主', '灵魂收集者', '大熊宝殿', '天谴女皇']
    },
    {
        question: '1.0.4版本时,全球首位达到巅峰100级的玩家是?',
        options: ['Alkaizer', '漫延', 'Gabynator', '春日の山']
    },
    {
        question: '2.0.1补丁移除了无限冰法师的哪个核心技能?',
        options: ['临界质量', '活体闪电', '逐风者', '冰冷之血']
    },
    {
        question: '第一幕中,为了去救迪卡凯恩,牺牲了多少名民兵?',
        options: ['16', '12', '7', '28']
    },
    {
        question: '曾经被称作"BUG锤"的武器是?',
        options: ['回荡狂怒', '日光守祭', '奥丁之子', '焚炉']
    },
    {
        question: '暗黑3的剧情中,哪位NPC炼成了黑灵魂石?',
        options: ['佐敦库勒', '玛格达', '爱德莉亚', '迪卡凯恩']
    },
    {
        question: '下列哪件物品是专家模式专属传奇?',
        options: ['先祖恩眷', '阿卡兰斯之星', '赫尔希恩之飞升', '暴風之盾']
    },
    {
        question: '韩服在2014年4月1日推出的新英雄是?',
        options: ['书生', '圣教军', '德鲁伊', '死灵法师']
    }
];

let data = [normal, hard, master, torment];

export default data;